<?php
//Comment
/**comment */


// echo 4;
// echo "\n"; // br - для переноса строки, важно "\n" чтоб были в двойных ковычках
// echo (4);
// echo PHP_EOL; // br - для переноса строки, 
// echo "5";
// echo "\n";
// echo 4, 5, 'Hello';
// **************************Вывод переменных ***********************//
// echo "\n================Вывод переменных================= \n";
// $foo = 15;
// $bar = 7;
// echo $foo + $bar;
// echo "\n";
// echo $foo - $bar;
// echo "\n";
// echo $foo / $bar;
// echo "\n";
// echo $foo * $bar;
// echo "\n";
// echo $foo % $bar;
// echo "\n";

// $s1 = 'Hi';
// $s2 = 'Test';
// echo $s1 . $s2; // конкатенация 
// $foo = 15;
// $bar = 7;
// echo '15 + 7 = '.($foo + $bar);


// // // ************************* Дроби  ***********************//
// echo "\n=============== Дроби ================= \n";
// $d = 8.5;
// echo $d + 11;


// // ************************* Строки  ***********************//
// echo "\n=============== Строки ================= \n";
// $d = 'string';
// echo $d;
// echo "\n";
// $f = '$d 888';
// echo $f;



// // ************************* SKOBKI  ***********************//
// echo "\n=============== SKOBKI  ================= \n";

// $a = 3;
// $b = 4;
// $c = ($a**2 + $b**2)**0.5; // быстрое возведение в степень 
// echo $c;

// ************************* Полезности  ***********************//
// echo "\n=============== Полезности  ================= \n";
// // var_dump($a); // без проблем позволяет понять нам что перед нами
// $d1 = 77.88;
// var_dump($d1);
// $f = 'string 888';
// var_dump($f);

// ************************* Полезности  ***********************//
echo "\n=============== Полезности  ================= \n";
// cls , clear - для очищения терминала 
// phpinfo(); //- для получения информация о PHP
// exec ('start calc'); // запускает программу которая есть в ПК